In [1]:
import pandas as pd
import numpy as np

In [2]:
forum_users = {
    'User ID': [1, 2, 3, 4, 5],
    'Username': ['klimsky', 'purt_120', 'fili_q', 'lupurpp', 'destralll'],
    'Age': [18, 20, 25, 30, 40],
    'Joined Date': pd.to_datetime(['2025-02-03', '2025-03-30', '2025-08-19', '2025-12-06', '2025-10-17']),
    'Total Posts': [300, 150, 200, 40, None],
    'Reputation': [70, 500, 90, 170, 40],
}

df = pd.DataFrame(forum_users)
df

   User ID   Username  Age Joined Date  Total Posts  Reputation
0        1    klimsky   18  2025-02-03        300.0          70
1        2   purt_120   20  2025-03-30        150.0         500
2        3     fili_q   25  2025-08-19        200.0          90
3        4    lupurpp   30  2025-12-06         40.0         170
4        5  destralll   40  2025-10-17          NaN          40

## Filtering

In [3]:
df[['Username', 'Age']]

    Username  Age
0    klimsky   18
1   purt_120   20
2     fili_q   25
3    lupurpp   30
4  destralll   40

In [4]:
df.loc[4]

User ID                          5
Username                 destralll
Age                             40
Joined Date    2025-10-17 00:00:00
Total Posts                    NaN
Reputation                      40
Name: 4, dtype: object

In [5]:
df.loc[2:3]

   User ID Username  Age Joined Date  Total Posts  Reputation
2        3   fili_q   25  2025-08-19        200.0          90
3        4  lupurpp   30  2025-12-06         40.0         170

In [6]:
df.loc[2:3, ['Username', 'Joined Date', 'Reputation']]

  Username Joined Date  Reputation
2   fili_q  2025-08-19          90
3  lupurpp  2025-12-06         170

In [7]:
df.iloc[3]

User ID                          4
Username                   lupurpp
Age                             30
Joined Date    2025-12-06 00:00:00
Total Posts                   40.0
Reputation                     170
Name: 3, dtype: object

In [8]:
df.iloc[2:4]

   User ID Username  Age Joined Date  Total Posts  Reputation
2        3   fili_q   25  2025-08-19        200.0          90
3        4  lupurpp   30  2025-12-06         40.0         170

In [9]:
df.iloc[2:4, 1:4]

  Username  Age Joined Date
2   fili_q   25  2025-08-19
3  lupurpp   30  2025-12-06

In [10]:
df.iloc[:]

   User ID   Username  Age Joined Date  Total Posts  Reputation
0        1    klimsky   18  2025-02-03        300.0          70
1        2   purt_120   20  2025-03-30        150.0         500
2        3     fili_q   25  2025-08-19        200.0          90
3        4    lupurpp   30  2025-12-06         40.0         170
4        5  destralll   40  2025-10-17          NaN          40

In [11]:
df.iloc[:, 1:3]

    Username  Age
0    klimsky   18
1   purt_120   20
2     fili_q   25
3    lupurpp   30
4  destralll   40

In [12]:
df[df['Age'] >= 25]

   User ID   Username  Age Joined Date  Total Posts  Reputation
2        3     fili_q   25  2025-08-19        200.0          90
3        4    lupurpp   30  2025-12-06         40.0         170
4        5  destralll   40  2025-10-17          NaN          40

In [13]:
df['Age'] >= 25

0    False
1    False
2     True
3     True
4     True
Name: Age, dtype: bool

In [14]:
df[df['Reputation'] >= 40]

   User ID   Username  Age Joined Date  Total Posts  Reputation
0        1    klimsky   18  2025-02-03        300.0          70
1        2   purt_120   20  2025-03-30        150.0         500
2        3     fili_q   25  2025-08-19        200.0          90
3        4    lupurpp   30  2025-12-06         40.0         170
4        5  destralll   40  2025-10-17          NaN          40

In [15]:
df[(df['Age'] >= 25) & (df['Reputation'] >= 90)]

   User ID Username  Age Joined Date  Total Posts  Reputation
2        3   fili_q   25  2025-08-19        200.0          90
3        4  lupurpp   30  2025-12-06         40.0         170

In [16]:
df[(df['Age'] >= 25) | (df['Reputation'] <= 90)]

   User ID   Username  Age Joined Date  Total Posts  Reputation
0        1    klimsky   18  2025-02-03        300.0          70
2        3     fili_q   25  2025-08-19        200.0          90
3        4    lupurpp   30  2025-12-06         40.0         170
4        5  destralll   40  2025-10-17          NaN          40

In [17]:
df['Reputation'].isin([200, 500])

0    False
1     True
2    False
3    False
4    False
Name: Reputation, dtype: bool

In [18]:
df[df['Reputation'].isin([200, 500])]

   User ID  Username  Age Joined Date  Total Posts  Reputation
1        2  purt_120   20  2025-03-30        150.0         500

In [19]:
df[df['Total Posts'].isin(range(150, 200))]

   User ID  Username  Age Joined Date  Total Posts  Reputation
1        2  purt_120   20  2025-03-30        150.0         500

In [21]:
date_range = pd.date_range(start='2025-08-01', end='2025-10-17')
date_range

DatetimeIndex(['2025-08-01', '2025-08-02', '2025-08-03', '2025-08-04',
               '2025-08-05', '2025-08-06', '2025-08-07', '2025-08-08',
               '2025-08-09', '2025-08-10', '2025-08-11', '2025-08-12',
               '2025-08-13', '2025-08-14', '2025-08-15', '2025-08-16',
               '2025-08-17', '2025-08-18', '2025-08-19', '2025-08-20',
               '2025-08-21', '2025-08-22', '2025-08-23', '2025-08-24',
               '2025-08-25', '2025-08-26', '2025-08-27', '2025-08-28',
               '2025-08-29', '2025-08-30', '2025-08-31', '2025-09-01',
               '2025-09-02', '2025-09-03', '2025-09-04', '2025-09-05',
               '2025-09-06', '2025-09-07', '2025-09-08', '2025-09-09',
               '2025-09-10', '2025-09-11', '2025-09-12', '2025-09-13',
               '2025-09-14', '2025-09-15', '2025-09-16', '2025-09-17',
               '2025-09-18', '2025-09-19', '2025-09-20', '2025-09-21',
               '2025-09-22', '2025-09-23', '2025-09-24', '2025-09-25',
               '2025-09-26', '2025-09-27', '2025-09-28', '2025-09-29',
               '2025-09-30', '2025-10-01', '2025-10-02', '2025-10-03',
               '2025-10-04', '2025-10-05', '2025-10-06', '2025-10-07',
               '2025-10-08', '2025-10-09', '2025-10-10', '2025-10-11',
               '2025-10-12', '2025-10-13', '2025-10-14', '2025-10-15',
               '2025-10-16', '2025-10-17'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df[df['Joined Date'].isin(date_range)]

   User ID   Username  Age Joined Date  Total Posts  Reputation
2        3     fili_q   25  2025-08-19        200.0          90
4        5  destralll   40  2025-10-17          NaN          40

## Sorting

In [23]:
df.sort_values(by='Joined Date', ascending=True)

   User ID   Username  Age Joined Date  Total Posts  Reputation
0        1    klimsky   18  2025-02-03        300.0          70
1        2   purt_120   20  2025-03-30        150.0         500
2        3     fili_q   25  2025-08-19        200.0          90
4        5  destralll   40  2025-10-17          NaN          40
3        4    lupurpp   30  2025-12-06         40.0         170

In [24]:
df.sort_values(by='Joined Date', ascending=False)

   User ID   Username  Age Joined Date  Total Posts  Reputation
3        4    lupurpp   30  2025-12-06         40.0         170
4        5  destralll   40  2025-10-17          NaN          40
2        3     fili_q   25  2025-08-19        200.0          90
1        2   purt_120   20  2025-03-30        150.0         500
0        1    klimsky   18  2025-02-03        300.0          70

In [26]:
df[['User ID', 'Total Posts', 'Reputation']]

   User ID  Total Posts  Reputation
0        1        300.0          70
1        2        150.0         500
2        3        200.0          90
3        4         40.0         170
4        5          NaN          40

In [27]:
df[['User ID', 'Total Posts', 'Reputation']].sort_values(by=2, axis=1, ascending=False)

   Total Posts  Reputation  User ID
0        300.0          70        1
1        150.0         500        2
2        200.0          90        3
3         40.0         170        4
4          NaN          40        5

In [28]:
df[['User ID', 'Total Posts', 'Reputation']].sort_values(by=1, axis=1, ascending=False)

   Reputation  Total Posts  User ID
0          70        300.0        1
1         500        150.0        2
2          90        200.0        3
3         170         40.0        4
4          40          NaN        5

In [30]:
df[['User ID', 'Total Posts', 'Reputation']].sort_values(by=0, axis=1, ascending=False)

   Total Posts  Reputation  User ID
0        300.0          70        1
1        150.0         500        2
2        200.0          90        3
3         40.0         170        4
4          NaN          40        5